[
    {
        "title": "mparticle",
        "content": "Home\nGuides\nDevelopers\nIntegrations\nChangelog\nmParticle is a customer data platform (CDP) that simplifies how you collect and connect your user data to hundreds of vendors without needing to manage multiple integrations. We simplify the entire process for you, so you can do more with your data without the hassle of complex integrations.\nNew to mParticle? Explore our UI with our interactive demo.\nGet Started\n1. Collect\nSend your first event to mParticle\n2. Validate\nEnsure data quality\n3. Connect\nForward data to a downstream services\nDo more with mParticle\nManage user identities with IDSync\nView and enforce your data quality\nEngage customer cohorts\nTransform data as it enters and leaves mParticle\nGet a complete view of your users\nEnsure compliance with GDPR, CCPA, and your privacy policies\nSend events directly to mParticle\nReal-time API to drive user personalization\nBuild your own custom integrations\nInputs\nAndroid\niOS\nWeb\nHTTP\nNode\nPython\nRuby\nJSON Reference\nBranch\nAppsFlyer\nBraze\nCustom CSV Feed\nOutputs\nMixpanel\nAmplitude\nFacebook\nBraze\nAppsFlyer\nFacebook\nSnapchat\nTwitter\nBraze\nPinterest\nCDP\nmParticle Docs\nHome\nGuides\nDevelopers\nIntegrations\nAnalytics\nAnalytics Docs\nOverview\nGetting Started\nDevelopers\nExpert Training\nPredictive AI\nCortex Docs\nOverview\nGetting Started\nDevelopers\nUsing Cortex\nLearn More\nBlog\nPodcast\nResources\nCommunity\nChange log\nGet in Touch\nHelp Center\nDemo\nBecome a Partner\nDo Not Sell or Share My Personal Data\n Manage Consent Preferences\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nUnder the CPRA, you have the right to opt-out of the sale or sharing of your personal information to third parties. These cookies collect information for analytics and to personalize your experience with targeted ads. You may exercise your right to opt out of the sale or sharing of personal information by using this toggle switch. If you opt out we will not be able to offer you personalized ads and will not hand over your personal information to any third parties. Additionally, you may contact our legal department for further clarification about your rights as a California consumer by using this Exercise My Rights link.If you have enabled privacy controls on your browser (such as a plugin), we have to take that as a valid request to opt-out. Therefore we would not be able to track your activity through the web. This may affect our ability to personalize ads according to your preferences.\nTargeting Cookies  Switch Label labelThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\nPerformance Cookies  Switch Label labelThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nCookie List"
    }
]